Revit 2024 API
FabricWireType.BendDiameter Property
 Determines the bending diameter of the wire.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public double BendDiameter { get; set; }
Visual Basic
Public Property BendDiameter As Double
	Get
	Set
Visual C++
public:
property double BendDiameter {
	double get ();
	void set (double value);
}
Field Value
 The value should be positive.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The given value for bendDiameter is not a number
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: The bending diameter bendDiameter is negative.
See Also
FabricWireType Class
Autodesk.Revit.DB.Structure Namespace